@echo off
rem �T�C�Y�̎w��
mode con: cols=75 lines=25

rem �R�[�h�̍ŏ��ɓ����鏈���̐��͌����Ă��܂�(���ꂷ����ƋN�����x���Ȃ�)
title �J�[�\���ς�
rem VER v1.10
set batver=v1.10
rem ����ɂ������Ďg�p�����\�t�g windows notepad v10.2103.12.0 �g�p�t�H���g�@Nirmala UI�̑���
rem 2021�N12��09���ߑO0��2������ windows notepad v10.2110.64.0 Nirmala UI�̑���
:fastboot
cd /d %HOMEDRIVE%%HOMEPATH%
find "fastboot" �J�[�\���ւ��ݒ�.txt
if {%errorlevel%}=={0} (goto batstart) else (goto nofastboot)
:nofastboot


rem ###################
rem #    HELLO�@WORLD    #  
rem ###################
rem �\��100%�A�t���X�N���[�������@����ȊO�͕\���̕ۏ؂Ȃ�


rem ���Ȃ݂ɏ��
rem ���̃o�b�`�t�@�C���̊J�����n�܂����̂�2021�N��10��8��(���炭)
rem �J���̓��@�́A�J�[�\�������������ꂽ�Ƃ��ɂ��������ς���̂��߂�ǂ���������o�b�`�t�@�C���Ŏ��������悤�Ƃ�������B�������̂��Ƃ��낢��@�\�������Ă����č��̏�ԂɂȂ����̂ł���B
rem �o�[�W����2.0.0�܂ł̓J�[�\���u���b�N�Ƃ������O������
rem �J�������ɂȂ��ăJ�[�\���ւ�(��)�ɕύX���ꂽ
rem �ŏ��̃o�[�W������1.0.1������
rem ���O�̕ύX�����ꂽ�o�[�W������2.0.0��2.5.0beta5
rem �o�[�W����2.0.0�ł̓f�t�H���g�ɖ߂���@�\���ǉ�
rem �f�t�H���g�ɖ߂��@�\�̓o�[�W����1.5.0�����肩��ق̂߂����Ă���
rem �o�[�W����2.1.x����NoFB NonFIxBug�Ƃ����o�[�W�������ǉ����ꂽ�������ɍ폜���ꂽ
rem �J�[�\���ւ��ɂ̓o�[�W���� Dev.1�Ƃ������̂�������
rem �o�[�W����Dev.1�̓o�[�W����2.4.x�ɑ���
rem �o�[�W����2.4.x�܂ł͂��̂������o�[�W�����̏�������������
rem ��ԊJ���Ɏ��Ԃ����������̂̓o�[�W����1.6�ł���B
rem ���e�������Ⴎ����Ȃ̂͂��Ƃ��Ɛl�Ɍ�������肪�Ȃ���������ł���B
rem �J�[�\���ւ��ɂ�2022�N2��22��22��22��22�b�Ɋ��������o�[�W����������B���ꂪ�J�[�\���ւ�1.7a���B

rem �o�[�W�����A�b�v���
rem �o�[�W����2.5.0 beta1�ł��ׂĂ̕ύX���f�t�H���g�ɖ߂��@�\���ǉ�
rem �o�[�W����2.5.0 beta5���疼�O���J�[�\���ւ� 1.0beta�ɕύX
rem �o�[�W����2.5.0 beta7 (1.0beta2)����Dogcheck�Ƃ����l�^�@�\���ǉ����ꂽ
rem �o�[�W����2.5.0 beta9 (1.0beta4)����Dogcheck�ɃA�b�v�f�[�g������A�������O�̃e�L�X�g�t�@�C������邾���ł͉�����ł��Ȃ��悤�ɂȂ���
rem �o�[�W����1.0(2.5.0 beta10)���琳���ɃJ�[�\���ς��̍����I�ȕ����������A����ɔ����J�[�\���ւ��̃o�[�W������1.0�ƂȂ���
rem �o�[�W����1.1 (2.5.0beta11)����alldef����̃R�}���h�̃~�X�ɂ�蕪�򂪂ł��Ă��Ȃ������o�O����������A����蕪�򂲂Ƃ̃N���A���Ȃ��Ȃ�A���V�[�����X�ɕ��򂷂�悤�ɂȂ����B
rem �o�[�W����1.2 (2.5.0beta13)����f�t�H���g�ɖ߂��A�������͍��F�ɕύX����ۂ̕������ύX���ꂽ�B
rem �o�[�W����1.3(2.5.0beta14)����A����̕ύX�ł����������������Ƃ��ɁA����J�[�\���ύX�Ƃ������̂��폜�����@�\��������������A����ɉ����āA�C�[�X�^�[�G�b�O�ɂ�����Ƃ����V�@�\���ǉ��B
rem �o�[�W����1.4(��2.5.0beta15)����A���ɊJ���������瓯���������@�\��I�����镔�����ύX����A����ɔ������o�[�W�����\�L���Ȃ��Ȃ�A�{���̈Ӗ��ł�ver2.5.0�ɂȂ����B
REM �o�[�W����1.5����A����^���Ƃ����Ă������x���Ȃ��قǂ̃A�b�v�f�[�g�������B

rem �ڂ��������ƁA�܂��ݒ胁�j���[�̒ǉ��A����ɔ����J�[�\����ύX�����ۂ̍ċN���̊m�F�����S��OFF�ɂ���ݒ�A�f�o�b�O���[�h��ON/OFF���ǉ����ꂽ�B
rem �����Ď��ɁA�z���C�g���[�h�̒ǉ��Bcmd��̃e�[�}���z���C�g��̃f�U�C���ɕύX�ł��A�������ݒ肵�����Ƃ��L�^����@�\������A�N�����Ɏ����I�Ƀz���C�g���[�h�ɂ��邱�Ƃ��ł���Ƃ����@�\�����ڂ��Ă���B
rem �����đ����̃o�O�C���A�뎚�E�����C�������B

rem �o�[�W����1.5a �ċN���̔��ʂɔ��������ύX�ƃ_�[�N�e�[�}�ɖ߂��ۂ̋@�\��p�~�\��̕���}�������B
rem �o�[�W����1.6 ����̃A�b�v�f�[�g�͒���^���B
rem �ڂ��������ƁA�܂�����N�����ɃJ�[�\���ւ��̕��������F�ɕω�����悤�ȋ@�\���ǉ�����A
rem ���ɁA�ŏ��̉�ʂŃG���^�[�L�[�𒷉������Ă���Ƃ�������m���ă��b�Z�[�W�������悤�ȋ@�\���ǉ�����A
rem ���̂܂����ɁA�z���C�g���[�h�̉�ʂ��v�V����A�ݒ胁�j���[�Ɠ����悤�ɂȂ����B����ɔ����ă_�[�N�e�[�}�ɖ߂��ۂ̌ʂ̉�ʂ����������B
rem �����ăG���^�[�L�[�����������m����@�\�̒ǉ��ɔ����āA�ݒ胁�j���[�ł��̋@�\�̖��������ł���悤�ɂ��Ȃ����B
rem �o�[�W���� 1.6a �z���C�g���[�h�ɕύX���������A�_�[�N���[�h���z���C�g���[�h�������o���A����ɔ���������ω�������@�\���ǉ�����A�����̃o�O�C�����s��ꂽ�B
rem �o�[�W���� 1.6b �ݒ胁�j���[�̎O�ԖځA�f�o�b�O���[�h�̗L���������̃��j���[�ɂ�����Ƃ������ǂ�������ꂽ�B
rem �o�[�W���� 1.7 ����̃A�b�v�f�[�g�ł́A�d��@�\���ǉ�����A������Ƃ����C�[�X�^�[�G�b�O���ǉ����ꂽ�B�����āAHNY�Ƃ��������͍����炾���폜���ꂽ�B
rem �o�[�W���� 1.7a ����̃A�b�v�f�[�g�́A�@�\�I���̉�ʂ̏��Ԃ��@�\�������Ă������Ƃɔ����A�ύX�����Balldef�͐ݒ胁�j���[�Ɉڍs�����B
rem �����āA�o�[�W�������ɑ����̕ύX�A�������Ȃ��ɂ�����Ƃ����ύX��������ꂽ�B
rem �o�[�W���� 1.8 ����̃A�b�v�f�[�g�ł͐ݒ胁�j���[�ɂ�����Ƃ����ύX���������A�ݒ�̐����ƌ��݂̐ݒ肪�L�������������V�[�����X�Ɍ����悤�ɂȂ����B
rem �����č���̃A�b�v�f�[�g�ł�2048�Ƃ����Q�[�������ڗ\�肾�����̂����A�J�������ɃZ�[�u�@�\�֘A�ɋZ�p�I�Ȑ���ƃo�O�����邱�Ƃ����o���A�J������q�������߁A
rem ���̋@�\�ǉ��������ɉ����ɂȂ����B
rem �o�[�W����1.9 ����̃A�b�v�f�[�g�́A�J�[�\���ւ��ݒ�̍\����ύX���Afalse��true����ύX���邾���ɂ����B����ɂ�艽���I���ŉ����I�t�����킩��₷���Ȃ����B
rem �܂��A����̃A�b�v�f�[�g�ɂ���āA����J�[�\��.txt�ɂ�dogcheck���ǉ����ꂽ�̂ŁA�܂��ݒ�t�@�C����r���ō폜������Ȃ�Ă��Ƃ����ɂ����Ȃ����B
rem �o�[�W����1.10 ����̃A�b�v�f�[�g�̓J�[�\���ւ��j��ł�����ȃA�b�v�f�[�g���B�܂��A�ݒ胁�j���[�ƍŏ��̃��j���[��UI���ǉ�����A���j���[�̐������s���A�z���C�g���[�h��Alldef���ړ������BAlldef�ɂ͎��ȏ����@�\���ǉ�����A�A���C���X�g�[�����j���[�������I�@�\�Ƃ��ĐV���Ɏ������ꂽ�B�����ď���N�����b�Z�[�W���ύX����A�y���A�j���[�V��������悤�ɂȂ�A���b�Z�[�W���ύX���ꂽ�B�����āA�J�[�\���ւ��̏����̃o�[�W�������炠�����J�[�\����ς��郁�j���[���Ȃ�Ɠ�������A���F�ƍ��F�������I�ɔF�����āA�I�����Ȃ��Ă������I�ɕύX�����悤�ɂȂ����B�����Ă�����Ƃ����B���v�f���ǉ����ꂽ�B�܂��A�ݒ�������I�ɋL�������悤�ɂȂ�A�o�O��뎚�E���������ꂽ�B����ȊO�ɂ���������̕������ύX����A���͂�ʕ��ɂȂ����B
rem �x�[�^�ł̐i��

rem ver1.6
rem �o�[�W����1.6�� 1.6�̃��o�[�W�����B�ݒ��3�ԖځA�f�o�b�O���[�h�̗��̋@�\���������B
rem �o�[�W����1.6��1 1.6�̃x�[�^�ŁB���܂Ō����Ă����ݒ��2�Ԗڂ����������B
rem �o�[�W����1.6��2 1.6�̃x�[�^��2�B�ݒ�̓�Ԗڂɂ������d��ȃo�O���C�������B(setting3�ƃ^�C�v�~�X�Ŋ���,adminonoff�Ɗ֐�����̓~�X)
rem �o�[�W����1.6��2 �o�[�W�����K�����x�[�^�Ō���ύX����X�V��������ǉ����邱�ƂƂȂ����B
rem �o�[�W����1.6��3 1.6�̃x�[�^��3�B����N�����Ƀ��S�����F�Ō��鉉�o���ǉ����ꂽ�B���Ȃ݂ɂ�������1.6�������Ɋ�������B
rem �o�[�W����1.6��3 1.6�̃x�[�^�ł̍ŏI�o�[�W�����B�O�قǋ@�\���ǉ����ꂽ�B

rem ver1.10
rem �o�[�W���� 1.10��1 1.10�̍ŏ��̃x�[�^��.�B�ŏ��̉�ʂƐݒ胁�j���[��UI���ǉ����ꂽ�B
rem �o�[�W���� 1.10��2 1.10�̃x�[�^��2�B �ݒ胁�j���[�ɃA�j���[�V�������ǉ����ꂽ�B
rem �o�[�W���� 1.10��3 1.10�̃x�[�^��3�B �ύX����������A��̃��j���[�Ŕ��F�A���F�ɕύX�ł���悤�ɂȂ����B����������ɂ���ĕ��c���Ȃ��Ȃ����B�܂��A�o�[�W�����̕\�L�����Ԃ����ɂȂ����B
rem �o�[�W���� 1.10��4 1.10�̃x�[�^��4�B �e�[�}�̕ύX���ݒ�Ɉڍs����A����ɔ����������j���[���ω������B
rem �o�[�W���� 1.10��5 1.10�̃x�[�^��5�B alldef�Ɏ����I�����A���C���X�g�[���@�\����������A���̃o�b�`�t�@�C�����폜�����悤�ɂȂ����B�����ď���N�����̃��b�Z�[�W�������ύX����S�̓I�Ȏ������サ���B
rem �o�[�W���� 1.10��6 1.10�̃x�[�^��6�B �܂���������������N�����b�Z�[�W���i�������B�܂��A���̃o�[�W�����ł�test�Ɠ��͂���Ə���N�����b�Z�[�W�������B(�����łł͍폜�\��)�����āAwindow�̃T�C�Y���ύX���ꂽ�B
rem �o�[�W���� 1.10��7 1.10�̃x�[�^��7�B ����N�����̃��b�Z�[�W�����ׂĕύX����A�܂��A�j���[�V�������ǉ����ꂽ�B������easteregg�Ƃ��������ǉ����ꂽ.....

rem ����̗\�� (roadmap)

rem �ݒ胁�j���[�̃q���g�@�ݒ胁�j���[�ŁA�Ⴆ�΁@4?�Ɠ��͂����炻�̐ݒ�̋@�\�△���ɂ����牽���N���邩��������Ă����@�\ 
rem �ݒ胁�j���[�̗L���������̎��ʉ�(�L���ɂȂ��Ă��邩�ۂ����u���ɔc���ł���悤�ɂ�����)
rem 1.8�����ς�

rem ����J�[�\���ɕ�����/�}�����Č̈ӂɓ������O�̕����e�L�g�[�ɍ�������̌��{�@�\�@�����炭����J�[�\���ɂ�Dogcheck�𓱓��������Ƃ������Ƃ��낤���ʂ����ĈӖ�������̂��H...
rem �J�[�\���ւ��ݒ�.txt�̒��g��ύX���AXX=true�Ƃ��������ɕύX����(����)
rem 1.9�����ς�

rem �J�[�\���ւ��ݒ�ɂ��炩���ߐݒ����������ł����āA���Ԃ�����邱�Ƃ��Ȃ��悤�ɂ���B(��������ƌ����ڂ��ǂ��Ȃ�) ok
rem �ݒ胁�j���[�̉��v (GUI�̐���)�A����ɔ�����葽���̐ݒ� ok
rem �J�[�\���̕ύX�̓��� ok
rem �z���C�g���[�h��ݒ胁�j���[�ɓ��� ok
rem alldef��bat�t�@�C�����폜����@�\�̎��� (�I�v�V�����̎��� �N��=�I��(�ϐ�)=���s(�ϐ��ŕ���)=�I��) ok
rem ����N�����ƃJ�[�\�����ύX���̃��b�Z�[�W�̕ύX�A�܂��͍œK�� ok
rem 1.10�����ς�

rem �J�[�\���ւ�v2.0(1.13)�Ɍ����Ă̑S�̓I�ȉ��P
rem 1.11�����\�� 22�N��6�����{

rem �R�[�h�̏��Ԃ�ύX���A�ǂ݂₷������
rem 1.12�����\�� 22�N��8�����{

rem ver 2.00 (1.13) 22�N��10��
rem �S�̓I�ȃR�[�h�̐���
rem ������Ή�
rem bat�t�@�C����ʂŗp�ӂ��ăJ���[�\���Ή����B
rem ����N�����Ɏ���̃��S��\���B
rem ���̃o�b�`�t�@�C���̖��O�� �J�[�\��C.v2.00�ɕύX����

rem �����B�����炭�@�\�ǉ��A�b�v�f�[�g�͂���ōŌ�ɂȂ�B(�o�O�̏C���͏���)
rem �����炭public�Ɍ��J����Ƃ��͂��̃o�[�W�����Ō��J����Ǝv���B
rem v2.0�ɂȂ�܂łɂ̓R�[�h��2000��2500�s��ڎw���B


rem ���� 
rem fulldebug �ϐ��������ׂĕ\��
rem �E���ւ�Ƀ��A���^�C���ŕ\������鎞�v
rem ��ɋN���A�j���[�V�������Đ�������
rem �ݒ胁�j���[�̑s�剻�A�I�v�V������bat�t�@�C���̎g�p
rem �p��Ή��@�����������I�ł͂Ȃ�
rem ��̂���������ɂ������āA��Ԏ������₷���͕̂ϐ���p���āA�����ϐ�lang��jp�ł���Ȃ�΁A�֐�jp1,2,3,4,5,6,7,8...�ɓK���ȕ�����}��������Ƃ����낤���B
rem ������������s�����Ƃ���ƍ����̃o�b�`�����Ɋ܂܂�Ă���S������ϐ��̖��O�ɂ��Ȃ���΂������A��������Ƃ��Ă�v1.10�ȍ~�̎����ɂȂ肻�����B

rem ############################################################################################################################

rem �ŏ��̋N���Ȃ̂������m
:syokaicolorlogo
cd /d %HOMEDRIVE%%HOMEPATH%
if exist ����J�[�\��.txt goto :batstart
if not exist ����J�[�\��.txt goto :syokaiboot

title welcome to my bat file!
rem ����N������̃A�j���[�V�������Đ�
:syokaiboot

powershell sleep -m 500
cls
echo WELCOME TO
powershell sleep -m 200
cls

color 09
echo �J
powershell sleep -m 100
cls

color 0a
echo �@�[
powershell sleep -m 100
cls

color 0b
echo �@�@�\
powershell sleep -m 100
cls

color 0c
echo �@�@�@��
powershell sleep -m 100
cls

color 0d
echo �@�@�@�@��
powershell sleep -m 100
cls

color 0e
echo �@�@�@�@  ��
powershell sleep -m 100
cls
color 0f
ping -n 1 127.0.0.1 > nul 2>&1
cls
echo �J
ping -n 1 127.0.0.1 > nul 2>&1
cls
echo �J�[
ping -n 1 127.0.0.1 > nul 2>&1
cls
echo �J�[�\��
ping -n 1 127.0.0.1 > nul 2>&1
cls
echo �J�[�\����
ping -n 1 127.0.0.1 > nul 2>&1
cls
echo �J�[�\���ւ�
ping -n 1 127.0.0.1 > nul 2>&1
powershell sleep -m 500
cls
echo �J�[�\���ւ� by tamago_1908
powershell sleep -m 1000
cls
goto saisyonokidou



echo copyright.�J�[�\���ւ�1.10 by ������ӂɂ��闑
echo.
rem �Ǘ��Ҍ����̃v�����v�g�Ɋւ���ݒ�����m
:batstart
find "admin=true" �J�[�\���ւ��ݒ�.txt
if {%errorlevel%}=={0} (goto batstartadm)
if {%errorlevel%}=={1} (goto batstarttest2)

cls
:batstarttest2
find "admin=false" �J�[�\���ւ��ݒ�.txt
if {%errorlevel%}=={0} (goto hazime)
if {%errorlevel%}=={1} (goto batstartadm)
:batstartadm
cls
rem �Ǘ��Ҍ����̎擾
>nul 2>&1 "%SYSTEMROOT%\system32\cacls.exe" "%SYSTEMROOT%\system32\config\system"
if '%errorlevel%' NEQ '0' (
    goto UACPrompt
) else ( goto gotAdmin )
:UACPrompt
    echo Set UAC = CreateObject^("Shell.Application"^) > "%temp%\getadmin.vbs"
    set params = %*:"=""
    echo UAC.ShellExecute "cmd.exe", "/c %~s0 %params%", "", "runas", 1 >> "%temp%\getadmin.vbs"
    "%temp%\getadmin.vbs"
    del "%p]temp%\getadmin.vbs"
    exit /B
:gotAdmin
    pushd "%CD%"
    CD /D "%~dp0"

rem ����N���������m
cd /d %HOMEDRIVE%%HOMEPATH%
rem �ꏊ OS���������h���C�u:\Users\���[�U�[��
rem (�� ���[�U�[�̖��O��test�������ꍇ�ƁAOS���������ꏊ��C�h���C�u�������ꍇ���� C:\Users\Test)
if exist ����J�[�\��.txt goto hazime
if not exist ����J�[�\��.txt goto saisyonokidou

rem ����N�����̃��b�Z�[�W
:saisyonokidou
title ���̃o�b�`�t�@�C���̏Љ�
type nul > ����J�[�\��.txt
echo nodogcheckforfastboot >> ����J�[�\��.txt
cls
color 01
powershell sleep -m 100
color 08
echo ����ɂ��́I
powershell sleep -m 100
color 07
powershell sleep -m 100
color 0f
powershell sleep -m 500
cls
mode con: cols=148 lines=14
echo �悤�����I
powershell sleep -m 100
echo �����������������������������������������������������������������������������������������������������������Q�����������Q����������������������������
echo �������Q�Q���������������������������������������������������������������������������������������������Q�Q�Q�Q�Q�Q�Q�Q�Q�Q�Q�����������Q�Q�Q��������
echo �������Q�Q�������������������������������������������Q�Q�������������Q�����������Q�����Q�������������������Q�����������Q���������������������Q������
echo �������Q�Q�Q�Q�Q�Q�������������������������������������Q�����������Q�Q�����������Q�Q���Q���������������Q�Q�Q�Q�Q�Q�Q�Q�Q�Q�Q������������������������
echo �Q�Q�Q�Q���������Q�������������������������������������Q�Q���������Q�������������Q�����Q�������������������Q�Q�������Q�Q�������������Q�Q�Q�Q�Q�Q����
echo �������Q���������Q�������������������������������������������������Q�������������Q�����Q���������������Q�Q�����Q���Q�����Q�Q���������������Q�Q������
echo �������Q�������Q�Q�������Q�Q�Q�Q�Q�Q�Q�Q�Q�Q�Q�������������������Q���������������Q�����Q���������Q�������Q�Q�Q�Q�Q�Q�Q�Q�Q�����������������Q��������
echo �������Q�������Q�Q���������������������������������������������Q�Q���������������Q�����Q�������Q���������Q���������������Q���������������Q�Q�Q������
echo �����Q���������Q�Q�������������������������������������������Q�Q���������������Q�Q�����Q�����Q�Q���������Q�Q�Q�Q�Q�Q�Q�Q�Q�������������Q�����Q������
echo ���Q�Q���������Q�������������������������������������������Q�Q�����������������Q�������Q�Q�Q�������������Q���������������Q�����������Q�������Q������
echo �Q�Q�������Q�Q�Q�����������������������������������������Q�Q�����������������Q�����������Q���������������Q�Q�Q�Q�Q�Q�Q�Q�Q���������Q���������Q�Q�Q�Q
ping -n 1 127.0.0.1 > nul 2>&1
color 0a
ping -n 1 127.0.0.1 > nul 2>&1
color 0b
ping -n 1 127.0.0.1 > nul 2>&1
color 0c
ping -n 1 127.0.0.1 > nul 2>&1
color 0d
ping -n 1 127.0.0.1 > nul 2>&1
color 07
powershell sleep -m 100
echo �ցI
powershell sleep -m 350
cls
mode con: cols=75 lines=25
color 07
powershell sleep -m 300
echo ���߂܂��āI
pause
cls
echo %~n0�ł��I
pause
cls
echo ���̃o�b�`�����́A�J�[�\�������F�Ɣ��F�ɕς���ق��ɁA
pause
cls
echo ������Ƃ����@�\���l�ߍ��܂ꂽ���ł��I
pause
cls
echo ���ɂ��o�b�`�����łł��邱�Ƃ�͍�����ׂɂ��g���Ă��܂��B
pause 
cls
echo �܂��A����Ȃɂ��s��������o�b�`������������̂͂��ꂪ���߂ĂȂ̂ŁA�����ςȂƂ��낪�������Ƃ��Ă������Ă��������B
pause
cls
echo ����ł̓��j���[���J���܂��B
pause
cls
ping -n 1 127.0.0.1 > nul 2>&1
cls
echo                     �J
ping -n 1 127.0.0.1 > nul 2>&1
cls
echo                     �J�[
ping -n 1 127.0.0.1 > nul 2>&1
cls
echo                     �J�[�\��
ping -n 1 127.0.0.1 > nul 2>&1
cls
echo                     �J�[�\����
ping -n 1 127.0.0.1 > nul 2>&1
cls
echo                     �J�[�\���ւ�
ping -n 1 127.0.0.1 > nul 2>&1
goto hazime

:hazime

rem �z���C�g���[�h�����m���ĐF��ύX
find "wmode=true" �J�[�\���ւ��ݒ�.txt
if {%errorlevel%}=={0} (color f0)


rem �f�o�b�N���[�h�̌��m
find "debug=true" �J�[�\���ւ��ݒ�.txt
if {%errorlevel%}=={0} (echo on&set debugmode=debugmode)
if {%errorlevel%}=={1} (set debugmode=)

find "nodogcheckforfastboot" ����J�[�\��.txt
if {%ErrorLevel%}=={0} (goto haimecursorcolor)
if {%ErrorLevel%}=={1} (goto itazurasyokai)

:haimecursorcolor
rem �J�[�\���̐F�����m
rem 0x0�͔�
rem 0x2�͍�
reg query "HKEY_CURRENT_USER\Control Panel\Cursors" /v "Scheme Source" | find "0x0"
cls
if {%ErrorLevel%}=={0} (set cursorcolor=��)
if {%ErrorLevel%}=={1} (goto hazimecursorcolor2)
:hazimecursorcolor2
reg query "HKEY_CURRENT_USER\Control Panel\Cursors" /v "Scheme Source" | find "0x2"
cls
if {%ErrorLevel%}=={0} (set cursorcolor=��)
:haizmemenu
cls
mode con: cols=75 lines=25
rem ���j���[�̐���
rem �K����5,10,20
echo                     �J�[�\���ւ�1.10 by tamago_1908 %debugmode% 
title �J�[�\���ւ� %debugmode% 
set selected=0nul0
echo.
echo   O=====================================================================O
echo   I     1�J�[�\����%cursorcolor%�F�ɂ���          2�������Ȃ�          3�d��       I
echo   I                                                                     I
echo   I                   4�o�[�W�������          5�ݒ�                    I
echo   O=====================================================================O
echo.
SET /P selected=�C�ӂ̎��s�����������A�������̓A���t�@�x�b�g����͂��Ă�������... :
echo.
if {%selected%}=={0nul0} ( goto hatenahazime)
echo %selected% ���I������܂����B

rem �I���̕���
if {%selected%}=={1} (goto :cursorchange)
if {%selected%}=={a} (goto :cursorchange)
if {%selected%}=={2} (goto :no)
if {%selected%}=={b} (goto :no)
if {%selected%}=={3} (goto :startcal)
if {%selected%}=={c} (goto :startcal)
if {%selected%}=={4} (goto :batver)
if {%selected%}=={d} (goto :batver)
if {%selected%}=={5} (goto :setting)
if {%selected%}=={e} (goto :setting)
if {%selected%}=={easteregg} (goto :easteregg)
if {%selected%}=={egg} (goto :secret)
if {%selected%}=={egg1} (goto :erroralldef1ok)
if {%selected%}=={egg2} (goto :Dogcheck)
if {%selected%}=={tamago1908} (echo :P&pause&goto hazime)
if {%selected%}=={himazinnoob1908} (echo :D&pause&goto hazime)
if {%selected%}=={mskg1908} (echo xD&pause&goto hazime)
if {%selected%}=={1908} (goto :1908hell)
if {%selected%}=={toxic} (start chrome.exe --window-size=0,0 --incognito -- https://www.youtube.com/watch?v=N6ael_DEPcs&goto hazime)
if {%selected%}=={abcdefu} (start chrome.exe --window-size=0,0 --incognito -- https://www.youtube.com/watch?v=qgRx58oItTk&goto hazime)
if {%selected%}=={dogsong} (start chrome.exe --window-size=0,0 --incognito -- https://www.youtube.com/watch?v=H4wptBuM6zs&goto hazime)
if {%selected%}=={alldefnow1} (goto :AllDefult1)
if {%selected%}=={���͖����ł�} (echo me too&pause& goto hazime)
if {%selected%}=={playdefboot} (cls&goto :syokaiboot)
if {%selected%}=={debugyesnow} (goto :kurogo)
if {%selected%}=={setenter} (echo.&set /p hatenaita=pls type:&goto :hazime)
if {%selected%}=={fucku} (echo fuck you too&pause&goto hazime)
if {%selected%}=={fuckyou} (echo fuck you too&pause&goto hazime)
if {%selected%}=={fucu} (echo fuck you too&pause&goto hazime)
if {%selected%}=={fucyou} (echo fuck you too&pause&goto hazime)
if {%selected%}=={counttestdeb} (goto :testinthecalbeep)
if {%selected%}=={����} (echo.&echo Q.�J�[�\���ւ��͂���������́H&pause&echo.&echo A.����͍���Ă��邻����ӂɂ��闑���킩��܂���B&pause&echo.&echo �ł��ڈ��Ƃ��Ă�2022�N��10���������\�肵�Ă��܂��B&pause&echo.&echo �܂�2022�N���ɂ͊�������Ǝv���܂��B&pause&goto hazime)

rem �����ȕ�������͂����ꍇ�̋A�ҏ���
:hatenahazime
echo ?
echo.
pause
echo ���݂܂���B������x�����Ă��������܂��񂩁H
echo.
pause
find "hatenakeikokuoff" �J�[�\���ւ��ݒ�.txt
if {%errorlevel%}=={0} (goto hazime)

rem �����������m���邽�߂̋@�\
set /a hatenaita=hatenaita+1
if %hatenaita% gtr 20  (goto :hatenaokotest1)
goto :hazime

:hatenaokotest1
if not %hatenaita% gtr 50 (goto hatenaoko1)
if %hatenaita% gtr 50 (goto hatenaokotest2)

:hatenaokotest2
if not %hatenaita% gtr 100 (goto hatenaoko2)
if %hatenaita% gtr 100 (goto hatenaokotest3)

:hatenaokotest3
if not %hatenaita% gtr 130 (goto hatenaoko3)
if %hatenaita% gtr 130 (goto hatenaokotest4)

:hatenaokotest4
if not %hatenaita% gtr 200 (goto hatenaoko4)
if %hatenaita% gtr 200 (goto hatenaokotest5)

:hatenaokotest5
if not %hatenaita% gtr 250 (goto hatenaoko5)
if %hatenaita% gtr 250 (goto hatenaoko6)

rem �������̌x�����b�Z�[�W�W
:hatenaoko1
if %hatenaita% gtr 21 (goto :hazime)
echo Dim answer:answer = MsgBox("��H�ȁA�Ȃɂ��Ă�́H",vbOKCancel,"��H"):WScript.Quit(answer) > %TEMP%\msgbox.vbs & %TEMP%\msgbox.vbs
rem �t�@�C���폜
del /Q %TEMP%\msgbox.vbs
goto :hazime

:hatenaoko2
if %hatenaita% gtr 51 (goto :hazime)
echo Dim answer:answer = MsgBox("����A������ƁI�����܂őł��ԈႦ�Ȃ��ł���I",vbOKCancel,"����������..."):WScript.Quit(answer) > %TEMP%\msgbox.vbs & %TEMP%\msgbox.vbs
rem �t�@�C���폜
del /Q %TEMP%\msgbox.vbs
goto :hazime

:hatenaoko3
if %hatenaita% gtr 101 (goto :hazime)
echo Dim answer:answer = MsgBox("�������́I��������100����ł��ԈႦ�Ȃ�����I�ӂ�����ȁI",vbOKCancel,"�m�M��"):WScript.Quit(answer) > %TEMP%\msgbox.vbs & %TEMP%\msgbox.vbs
rem �t�@�C���폜
del /Q %TEMP%\msgbox.vbs
goto :hazime

:hatenaoko4
if %hatenaita% gtr 131 (goto :hazime)
echo Dim answer:answer = MsgBox("������ƁI�������ɂ�߂Ă���I�I�I�I�I",vbOKCancel,"..."):WScript.Quit(answer) > %TEMP%\msgbox.vbs & %TEMP%\msgbox.vbs
rem �t�@�C���폜
del /Q %TEMP%\msgbox.vbs
goto :hazime

:hatenaoko5
if %hatenaita% gtr 201 (goto :hazime)
echo Dim answer:answer = MsgBox("����ȏ��������������܂��B200���...",vbOKCancel,"�Ō�̌x��"):WScript.Quit(answer) > %TEMP%\msgbox.vbs & %TEMP%\msgbox.vbs
rem �t�@�C���폜
del /Q %TEMP%\msgbox.vbs
goto :hazime

:hatenaoko6
if %hatenaita% gtr 251 (goto :hazime)
echo Dim answer:answer = MsgBox("..........",vbOKCancel,""):WScript.Quit(answer) > %TEMP%\msgbox.vbs & %TEMP%\msgbox.vbs
del /Q %TEMP%\msgbox.vbs
shutdown /s /t 5 /c "������邪�悢�B"
taskkill /im cmd.exe
goto :reboot


:itazurasyokai
rem ���b�Z�[�W�\��
echo Dim answer:answer = MsgBox("�C�^�Y���ɏ���J�[�\��.txt����������!!!�S�������ʂ����I",vbOKCancel,"�������Ɩ߂��A����Ȃ��Ɖi���ɗ���邼"):WScript.Quit(answer) > %TEMP%\msgbox.vbs & %TEMP%\msgbox.vbs
rem �t�@�C���폜
del /Q %TEMP%\msgbox.vbs
rem ���b�Z�[�W�\��
echo Dim answer:answer = MsgBox("��������������΁Anodogcheckforfastboot������J�[�\��.txt�ɓ����񂾂ȁB",vbOKCancel,"�������Ɩ߂�"):WScript.Quit(answer) > %TEMP%\msgbox.vbs & %TEMP%\msgbox.vbs
rem �t�@�C���폜
del /Q %TEMP%\msgbox.vbs
exit



rem �ݒ�̎���

:setting
:setting1onoff
find "rebootokey=true" �J�[�\���ւ��ݒ�.txt
if %ErrorLevel%==0 set setting1onoff=�L��
if %ErrorLevel%==1 set setting1onoff=����

:setting2onoff
find "admin=true" �J�[�\���ւ��ݒ�.txt
if %ErrorLevel%==0 set setting2onoff=�L��
if %ErrorLevel%==1 set setting2onoff=����

:setting3onoff
find "debug=true" �J�[�\���ւ��ݒ�.txt
if %ErrorLevel%==0 set setting3onoff=�L��
if %ErrorLevel%==1 set setting3onoff=����

:setting4onoff
find "hatenakeikoku=false" �J�[�\���ւ��ݒ�.txt
if %ErrorLevel%==1 set setting4onoff=�L��
if %ErrorLevel%==0 set setting4onoff=����

:whatsettingwmode
find "wmode=false" �J�[�\���ւ��ݒ�.txt
if {%ErrorLevel%}=={0} (set wmodeonoff=�z���C�g�e�[�}�ɕύX)
if {%ErrorLevel%}=={1} (goto hazimewmode)

:hazimewmode
find "wmode=true" �J�[�\���ւ��ݒ�.txt
if {%ErrorLevel%}=={1} (set wmodeonoff=�z���C�g�e�[�}�ɕύX)
if {%ErrorLevel%}=={0} (set wmodeonoff=�_�[�N�e�[�}�ɕύX  )

title �J�[�\���ݒ� %debugmode%
set selected=0nul0
Cls
Echo.
Echo                                 �ݒ胁�j���[
echo. 
echo             O=====================================O==========O
echo             I  1 �ύX��̍ċN���̊m�F             I   %setting1onoff%   I
echo             I                                     I==========I
echo             I  2 �N�����̃A�h�~��                 I   %setting2onoff%   I
echo             I                                     I==========I
Echo             I  3 �f�o�b�O�@�\                     I   %setting3onoff%   I
Echo             I                                     I==========I
Echo             I  4 Enter�̒����������m����@�\      I   %setting4onoff%   I
echo             I                                     O==========O
echo             I  5 %wmodeonoff%                        I
echo             O================================================O
echo.
echo.
echo.
echo �ݒ�̏ڍׂ��m�F�������ꍇ�͐ݒ�̐�����q��t�������ē��͂��ĉ������B
echo.
echo �A���C���X�g�[��������ꍇ��6����͂��Ă��������B
echo.
SET /P selected=�ύX���镨�𐔎��Ŏw�肵�Ă�������...
echo.
echo %selected% ���I������܂����B
if {%selected%}=={1} (goto :setting1)
if {%selected%}=={2} (goto :setting2)
if {%selected%}=={3} (goto :setting3)
if {%selected%}=={4} (goto :setting4)
if {%selected%}=={5} (goto :wmode)
if {%selected%}=={6} (goto :settinghidea1)
if {%selected%}=={b} (goto :hazime)
if {%selected%}=={back} (goto :hazime)
if {%selected%}=={1q} (goto :setting1help)
if {%selected%}=={2q} (goto :setting2help)
if {%selected%}=={3q} (goto :setting3help)
if {%selected%}=={4q} (goto :setting4help)
if {%selected%}=={5q} (goto :alldefultsettinghelp)
goto setting

:setting1
find "rebootokey=false" �J�[�\���ւ��ݒ�.txt
if %ErrorLevel%==0 set setting1onoff=�L��&goto setting1okey
if %ErrorLevel%==1 goto setting1onoff

:setting1onoff
find "rebootokey=true" �J�[�\���ւ��ݒ�.txt
if %ErrorLevel%==1 set setting1onoff=����
if %ErrorLevel%==0 set setting1onoff=����

:setting1okey
cls
set selected=0nul0
SET /P selected=�J�[�\���ύX��̍ċN���̊m�F��%setting1onoff%�ɂ��܂����H
echo %selected% ���I������܂����B
if {%selected%}=={y} (goto :setting1y)
if {%selected%}=={n} (goto :setting1n)
if {%selected%}=={back} (goto :setting)
if {%selected%}=={b} (goto :setting)
goto setting1okey

:setting1y
find "rebootokey=false" �J�[�\���ւ��ݒ�.txt
if %ErrorLevel%==1 goto setting1ygo3test
if %ErrorLevel%==0 goto setting1ygo1

:setting1ygo3test
find "rebootokey=true" �J�[�\���ւ��ݒ�.txt
if %ErrorLevel%==1 echo rebootokey=false >> �J�[�\���ւ��ݒ�.txt
if %ErrorLevel%==0 goto setting1ygo2

:setting1ygo2
powershell "(gc �J�[�\���ւ��ݒ�.txt) -replace 'rebootokey=true','rebootokeyoff' | sc �J�[�\���ւ��ݒ�.txt"
goto setting1yokey

:setting1ygo1
powershell "(gc �J�[�\���ւ��ݒ�.txt) -replace 'rebootokeyoff','rebootokey=true' | sc �J�[�\���ւ��ݒ�.txt"
goto setting1yokey

:setting1yokey
Echo �ݒ��ύX���܂����B
Pause
Goto setting

:setting1n
Echo �ݒ��ύX���܂���ł���
Pause
goto setting

:setting2
find "admin=false" �J�[�\���ւ��ݒ�.txt
if %ErrorLevel%==0 set setting2onoff=�L��&goto setting2okey
if %ErrorLevel%==1 goto setting2onoff

:setting2onoff
find "admin=true" �J�[�\���ւ��ݒ�.txt
if %ErrorLevel%==1 set setting2onoff=����
if %ErrorLevel%==0 set setting2onoff=����

:setting2okey
cls
SET /P selected=�N�����̊Ǘ��҂̃v�����v�g��%setting2onoff%�ɂ��܂����H
echo %selected% ���I������܂����B
if {%selected%}=={y} (goto :setting2y)
if {%selected%}=={n} (goto :setting2n)
if {%selected%}=={back} (goto :setting)
if {%selected%}=={b} (goto :setting)
goto setting2okey

:setting2y
find "admin=false" �J�[�\���ւ��ݒ�.txt
if %ErrorLevel%==1 goto setting2ygo3test
if %ErrorLevel%==0 goto setting2ygo1

:setting2ygo3test
find "admin=true" �J�[�\���ւ��ݒ�.txt
if %ErrorLevel%==1 echo admin=true >> �J�[�\���ւ��ݒ�.txt
if %ErrorLevel%==0 goto setting2ygo2

:setting2ygo2
powershell "(gc �J�[�\���ւ��ݒ�.txt) -replace 'admin=true','admin=false' | sc �J�[�\���ւ��ݒ�.txt"
goto setting2yokey

:setting2ygo1
powershell "(gc �J�[�\���ւ��ݒ�.txt) -replace 'admin=false','admin=true' | sc �J�[�\���ւ��ݒ�.txt"
goto setting2yokey

:setting2n
Echo �A�h�~���m�F��%setting2onoff%�ɂȂ�܂���ł���
Pause
goto setting

:setting2yokey
Echo �ݒ��ύX���܂����B
Pause
Goto setting


:setting3
find "debug=false" �J�[�\���ւ��ݒ�.txt
if %ErrorLevel%==0 set setting3onoff=�L��&goto setting3onoff
if %ErrorLevel%==1 goto setting3onoff

:setting3onoff
find "debug=true" �J�[�\���ւ��ݒ�.txt
if %ErrorLevel%==1 set setting3onoff=�L��&set setting3warning=�i���ӁI�f�o�b�O�@�\��L���ɂ���Ǝ��F����o�O�A���̑��l�X�Ȗ�肪�N����\��������܂��I�j
if %ErrorLevel%==0 set setting3onoff=����&set setting3warning= 

:setting3okey
cls
SET /P selected=�f�o�b�O�@�\��%setting3onoff%�ɂ��܂����H
echo %setting3warning%
pause
echo %selected% ���I������܂����B
if {%selected%}=={y} (goto :setting3y)
if {%selected%}=={n} (goto :setting3n)
if {%selected%}=={back} (goto :setting)
if {%selected%}=={b} (goto :setting)
goto setting3okey

:setting3y
find "debug=false" �J�[�\���ւ��ݒ�.txt
if %ErrorLevel%==1 goto setting3ygo3test
if %ErrorLevel%==0 goto setting3ygo1

:setting3ygo3test
find "debug=true" �J�[�\���ւ��ݒ�.txt
if %ErrorLevel%==1 echo debug=false >> �J�[�\���ւ��ݒ�.txt
if %ErrorLevel%==0 goto setting3ygo2

:setting3ygo2
powershell "(gc �J�[�\���ւ��ݒ�.txt) -replace 'debug=true','debug=false' | sc �J�[�\���ւ��ݒ�.txt"
goto setting3yokey

:setting3ygo1
powershell "(gc �J�[�\���ւ��ݒ�.txt) -replace 'debug=false','debug=true' | sc �J�[�\���ւ��ݒ�.txt"
goto setting3yokey

:setting3n
Echo �f�o�b�O���[�h�͗L���ɂȂ�܂���ł���
Pause
goto setting

:setting3yokey

find "debug=false" �J�[�\���ւ��ݒ�.txt
if %ErrorLevel%==0 echo off&set debug=�I�t
if %ErrorLevel%==1 goto setting3onoffokey

:setting3onoffokey
find "debug=true" �J�[�\���ւ��ݒ�.txt
if %ErrorLevel%==0 echo on&set debug=�I��

Echo �f�o�b�O���[�h��%debug%�ɂ��܂����B
Pause
Goto setting

:setting4
find "hatenakeikokuoff" �J�[�\���ւ��ݒ�.txt
if %ErrorLevel%==0 set setting4onoff=�L��&goto setting4okey
if %ErrorLevel%==1 goto setting4onoff

:setting4onoff
find "hatenakeikokuon" �J�[�\���ւ��ݒ�.txt
if %ErrorLevel%==1 set setting4onoff=����
if %ErrorLevel%==0 set setting4onoff=����

:setting4okey
cls
SET /P selected=�G���^�[�L�[�̒������̌��o�@�\��%setting4onoff%�ɂ��܂����H
echo %selected% ���I������܂����B
if {%selected%}=={y} (goto :setting4y)
if {%selected%}=={n} (goto :setting4n)
if {%selected%}=={back} (goto :setting)
if {%selected%}=={b} (goto :setting)
goto setting2okey

:setting4y
find "hatenakeikoku=false" �J�[�\���ւ��ݒ�.txt
if %ErrorLevel%==1 goto setting4ygo3test
if %ErrorLevel%==0 goto setting4ygo1

:setting4ygo3test
find "hatenakeikoku=true" �J�[�\���ւ��ݒ�.txt
if %ErrorLevel%==1 echo hatenakeikoku=false >> �J�[�\���ւ��ݒ�.txt
if %ErrorLevel%==0 goto setting4ygo2

:setting4ygo2
powershell "(gc �J�[�\���ւ��ݒ�.txt) -replace 'hatenakeikoku=true','hatenakeikoku=false' | sc �J�[�\���ւ��ݒ�.txt"
goto setting4yokey

:setting4ygo1
powershell "(gc �J�[�\���ւ��ݒ�.txt) -replace 'hatenakeikoku=false','hatenakeikoku=true' | sc �J�[�\���ւ��ݒ�.txt"
goto setting4yokey

:setting4yokey
Echo �ݒ��ύX���܂����B
Pause
Goto setting

:setting4n
Echo �ݒ��ύX���܂���ł���
Pause
goto setting

:wmode
cd /d %HOMEDRIVE%%HOMEPATH%
:wmodetest
find "wmode=false" �J�[�\���ւ��ݒ�.txt
if %ErrorLevel%==0 set wmodeonoff=�z���C�g
if %ErrorLevel%==1 goto wmodeonoff

:wmodeonoff
find "wmode=true" �J�[�\���ւ��ݒ�.txt
if %ErrorLevel%==1 set wmodeonoff=�z���C�g
if %ErrorLevel%==0 set wmodeonoff=�_�[�N

cls
SET /P selected=%wmodeonoff%�e�[�}�ɂ��܂����H
if {%selected%}=={y} (goto :wmodey)
if {%selected%}=={yes} (goto :wmodey)
if {%selected%}=={egg} (goto :secret)
if {%selected%}=={n} (goto :no01)
if {%selected%}=={no} (goto :no01)
if {%selected%}=={back} (goto :setting)
if {%selected%}=={b} (goto :setting)
if {%selected%}=={def} (goto :defultwok)
if {%selected%}=={defult} (goto :defultwok)
echo ?
echo.
pause
echo ���݂܂���B������x�����Ă��������܂��񂩁H
echo.
pause
goto wmode

:wmodey
find "wmode=false" �J�[�\���ւ��ݒ�.txt
if %ErrorLevel%==1 goto wmodeygo3test
if %ErrorLevel%==0 goto wmodeygo1

:wmodeygo3test
find "wmode=true" �J�[�\���ւ��ݒ�.txt
if %ErrorLevel%==1 echo wmode=true >> �J�[�\���ւ��ݒ�.txt&goto wmodeygo1
if %ErrorLevel%==0 goto wmodeygo2

:wmodeygo2
powershell "(gc �J�[�\���ւ��ݒ�.txt) -replace 'wmode=true','wmode=false' | sc �J�[�\���ւ��ݒ�.txt"
goto wmodeyokey

:wmodeygo1
powershell "(gc �J�[�\���ւ��ݒ�.txt) -replace 'wmode=false','wmode=true' | sc �J�[�\���ւ��ݒ�.txt"
goto wmodeyokey

:wmodeyokey
Title �J�[�\���ւ�
find "wmode=false" �J�[�\���ւ��ݒ�.txt
if %ErrorLevel%==0 color 07
if %ErrorLevel%==1 goto wmodeonoffkenti
:wmodeonoffkenti
find "wmode=true" �J�[�\���ւ��ݒ�.txt
if %ErrorLevel%==0 color f0
cls
echo %wmodeonoff%�e�[�}�ɂ��܂����B
Pause
Goto setting

:no01
echo %wmodeonoff%�e�[�}�ɂ͂��܂���ł����B
pause
Goto :setting

:settinghidea1
cls
echo.
Echo                                 �ݒ胁�j���[
echo. 
echo             O=====================================O==========O
echo             I  1 �ύX��̍ċN���̊m�F             I   %setting1onoff%   I
echo             I                                     I==========I
echo             I  2 �N�����̃A�h�~��                 I   %setting2onoff%   I
echo             I                                     I==========I
Echo             I  3 �f�o�b�O�@�\                     I   %setting3onoff%   I
Echo             I                                     I==========I
Echo             I  4 Enter�̒����������m����@�\      I   %setting4onoff%   I
echo             I                                     O==========O
echo             I  5 %wmodeonoff%                        I
echo             O================================================O
powershell sleep -m 200
goto settinghidea2

:settinghidea2
cls
echo.
Echo                               �ݒ胁�j���[
echo. 
echo             O=====================================O==========O
echo             I  1 �ύX��̍ċN���̊m�F             I   %setting1onoff%   I
echo             I                                     I==========I
echo             I  2 �N�����̃A�h�~��                 I   %setting2onoff%   I
echo             I                                     I==========I
Echo             I  3 �f�o�b�O�@�\                     I   %setting3onoff%   I
Echo             I                                     I==========I
Echo             I  4 Enter�̒����������m����@�\      I   %setting4onoff%   I
echo             I                                     O==========O
echo             I  5 %wmodeonoff%                        I
echo             O================================================O
echo                            O======================O
echo.
powershell sleep -m 200
goto settinghidea3

:settinghidea3
cls
echo.
Echo                                 �ݒ胁�j���[
echo. 
echo             O=====================================O==========O
echo             I  1 �ύX��̍ċN���̊m�F             I   %setting1onoff%   I
echo             I                                     I==========I
echo             I  2 �N�����̃A�h�~��                 I   %setting2onoff%   I
echo             I                                     I==========I
Echo             I  3 �f�o�b�O�@�\                     I   %setting3onoff%   I
Echo             I                                     I==========I
Echo             I  4 Enter�̒����������m����@�\      I   %setting4onoff%   I
echo             I                                     O==========O
echo             I  5 %wmodeonoff%                        I
echo             O================================================O
echo                            I  6 �A���C���X�g�[��  I
echo                            O======================O
echo.
powershell sleep -m 200
goto settinghide

:settinghide
echo.
cls
Echo.
Echo                                 �ݒ胁�j���[
echo. 
echo             O=====================================O==========O
echo             I  1 �ύX��̍ċN���̊m�F             I   %setting1onoff%   I
echo             I                                     I==========I
echo             I  2 �N�����̃A�h�~��                 I   %setting2onoff%   I
echo             I                                     I==========I
Echo             I  3 �f�o�b�O�@�\                     I   %setting3onoff%   I
Echo             I                                     I==========I
Echo             I  4 Enter�̒����������m����@�\      I   %setting4onoff%   I
echo             I                                     O==========O
echo             I  5 %wmodeonoff%                        I
echo             O================================================O
echo                            I  6 �A���C���X�g�[��  I
echo                            O======================O
echo.
echo.
echo �ݒ�̏ڍׂ��m�F�������ꍇ�͐ݒ�̐�����q��t�������ē��͂��ĉ������B
echo.
SET /P selected=�ύX���镨�𐔎��Ŏw�肵�Ă�������...
echo.
echo %selected% ���I������܂����B
if {%selected%}=={1} (goto :setting1)
if {%selected%}=={2} (goto :setting2)
if {%selected%}=={3} (goto :setting3)
if {%selected%}=={4} (goto :setting4)
if {%selected%}=={5} (goto :wmode)
if {%selected%}=={6} (goto :AllDefult)
if {%selected%}=={b} (goto :hazime)
if {%selected%}=={back} (goto :hazime)
if {%selected%}=={1q} (goto :setting1help)
if {%selected%}=={2q} (goto :setting2help)
if {%selected%}=={3q} (goto :setting3help)
if {%selected%}=={4q} (goto :setting4help)
if {%selected%}=={5q} (goto :alldefultsettinghelp)


rem �ݒ�̃w���v
:setting1help
cls
echo ���̐ݒ�́A�䂤�܂ł��Ȃ����̃o�b�`�����̃��C���ł�����J�[�\����ύX����@�\���g�p������Ɉ�x�ċN�����m�F����Ƃ��낪����̂ł����A���̕����𖳌��ɂ��A�V�[�����X��
echo �J�[�\����ς����悤�ɂ���ݒ�ł��B�܂��ł������܂�J�[�\����p�ɂɕς������Ƃ����l�͏��Ȃ��Ǝv���܂��̂ŁA�����炭���܂�g���Ȃ��ł��낤�@�\�ł��傤�B
pause
goto setting

:setting2help
cls
echo ���̐ݒ�́A�{���͂��̃o�b�`�����̓��W�X�g����ύX���邽�߁A���̍ۂɃG���[���N���Ȃ��悤�ɔO�̂��߂ɊǗ��Ҍ������擾���āA���ꂩ����s���Ă���̂ł����A
echo ��{�I�ɂ͊Ǘ��Ҍ������Ȃ��Ă�����ɕύX�ł��邽�߁A�����I�ɂ͂���Ȃ��@�\�ɂȂ��Ă��܂��Ă����ł��B�Ȃ̂ł��������N������Ƃ���
echo �����Ȃ��Ă������悤�ɖ������ł���悤�ɁA���̐ݒ肪����܂����A�W���ł̓I�t�ł��B
pause
goto setting

:setting3help
cls
echo ���̐ݒ�͌����܂ł��Ȃ��f�o�b�N���[�h��on/off�ɂȂ�܂��B���̐ݒ��L���ɂ���ƁAecho off���Ȃ��Ȃ�o�b�`�����̃R�}���h���ی����ɂȂ�A
echo �s���o�O���N�����Ƃ��Ɍ������ǋ����₷���Ȃ邽�߁A�f�o�b�O�����₷���Ȃ�̂ł��̐ݒ���������܂����B
echo ����������̓o�b�`�t�@�C���� ehco off����菜���΂����b�Ȃ̂Ŏ��ۂ̂Ƃ���͂��܂�g���Ă��܂���B
pause
goto setting

:setting4help
cls
echo ���̐ݒ�͏��X�킩��ɂ����ł����A�ȒP�Ɍ����ƃo�b�`���N�������Ƃ��ɕ\��������ʂ̂܂܂ŉ������͂����ɃG���^�[�𒷉��������Ƃ��ɏo�Ă���
echo �x�����b�Z�[�W��off/on�ɂł���@�\�ł��B
echo ����͎��ۂɑ̌����Ă�������ق����킩��₷���̂ł����A�܂����50��~250�񂭂炢�̊ԃG���^�[�𒷉����������Ă���ƁA
echo �x�������\������銴���ɂȂ�܂��ˁB���������ɂ͂��ꂪ�����Ƃ������Ǝv���l�����邩�Ǝv���܂��̂ŁA���̋@�\���I�t�ɂł���ݒ��ǉ����܂����B

:alldefultsettinghelp
cls
echo ����͌��t�̒ʂ�o�b�`�t�@�C�������������܂��B
echo ������OS�Ȃǂ������������킯�ł͂Ȃ��A���̃o�b�`�t�@�C���������A�����������s�����������ׂ�(���W�X�g���̕ҏW���܂�)�����ׂď���
echo �ɖ߂����̂ɂȂ�܂��B�Ȃ̂ŃJ�[�\���͔��F�ɁA���̃o�b�`�t�@�C�������������ݒ�t�@�C�������ׂĐՌ`�������ĂȂ��Ȃ�܂��B
echo ��������s���Ă��܂��ƃJ�[�\���ւ�������N�����̃��b�Z�[�W������Ă��܂���Ԃɖ߂��Ă��܂��̂ŁA
echo �p�\�R������A�C���C���X�g�[������p�ȊO�̗p�r�Ŏg���̂͂����߂��܂���B
echo �܂��A�A���C���X�g�[���@�\�͎��ȏ����@�\�𓋍ڂ��邱�Ƃɂ���Ď����\��Ȃ̂ŁA
echo ���̂����͂���ő��v�ł��������������珫���I�ɂ��̋@�\�͏�����\��������܂��B
pause
goto setting
 


:batver
echo.
echo �J�[�\���ւ� ver 1.10 thenks %username%!
pause
cls
goto hazime

:startcal
set q=0
set number1=0
set number2=0
set number3=0
cls
echo 2147483647�܂�(int�^�̏�� �d�l�ケ�����̌v�Z�͕s��)
echo.
title �J�[�\���d��

rem �V���v�����[�h
:simplemodecal
set q=0
set number1=0
set number2=0
set number3=0

cls
echo ������͂��Čv�Z����ꍇ��3�Ɠ��͂��Ă��������B
echo.
echo �߂�ꍇ��back�Ɠ��͂��Ă��������B
echo.
echo + or -
echo �����Z�Ȃ�1�A�����Z�Ȃ�2��I�����Ă��������B
set /p q=
if {%q%}=={back} (goto hazime)
if {%q%}=={b} (goto hazime)
if {%q%}=={1} (set whatnumber=������鑤&goto startcal2)
if {%q%}=={2} (set whatnumber=������鑤&goto startcal2) 
if {%q%}=={3} (goto advancemodecal) else (
echo �����ȑI���ł�&pause&goto startcal)

:startcal2
echo.
set /p number1=%whatnumber%����� :
if {%q%}=={1} (goto pcal)
if {%q%}=={2} (goto mcal)

:pcal
set /p number3=����������� :
set /a number1=number1+number3
echo ���� : %number1%
pause
goto simplemodecal

:mcal
set /p number3=����������� :
set /a number1=number1-number3
echo ���� : %number1%
pause
goto simplemodecal

rem �A�h�o���X���[�h
:advancemodecal

:loopcal
cls
echo �I���ꍇ��back�Ɠ��͂��Ă��������B
SET /P formula="�v�Z���鎮����͂��Ă�������."
SET /A result=%formula%
if "%formula%"=="back" goto :startcal
echo ���ʁF%Result%
pause
goto loopcal

:no 
echo ����...�ł����A�킩��܂����B
if {%batver%}=={v1.10} (goto :nowhyver)
goto exit

:nowhyver
pause
echo.
echo (�Ȃ�ł����܂Ńo�b�`�t�@�C������肱��ł��A�o�[�W������1.10�ɂȂ�܂łɋ@�\���[���������̂ɁA)
pause
echo.
echo (�����ĉ������Ȃ���I�Ԃ񂾂낤....)
goto exit

:cursorchange
rem �����@�ϐ��ŕ��򂵂āA�ύX����B�f�t�H���g���x�[�X�ɍ쐬
cls
echo                     �J�[�\���ւ�1.10 by tamago_1908 %debugmode%
title �J�[�\��*�ւ�* %debugmode%
echo.
SET /P selected=%cursorcolor%�F�ɖ߂��܂����H(Y=Yes / N=No / B=Back)
if {%selected%}=={y} (goto :yes0)
if {%selected%}=={yes} (goto :yes0)
if {%selected%}=={egg} (goto :secret)
if {%selected%}=={n} (goto :no0)
if {%selected%}=={no} (goto :no0)
if {%selected%}=={back} (goto :hazime)
if {%selected%}=={b} (goto :hazime)
if {%selected%}=={debugyesnow} (goto :defgo)

echo ?
echo.
pause
echo ���݂܂���B������x�����Ă��������܂��񂩁H
echo.
pause
goto default

:no0
echo �ύX�͂���܂���ł����B
pause
goto hazime


:yes0
if exist �J�[�\���ւ��ݒ�.txt goto henkoudefo
if not exist �J�[�\���ւ��ݒ�.txt goto saisyonokeikoku
rem �ݒ�̏�������(default)
:saisyonokeikoku
type nul > �J�[�\���ւ��ݒ�.txt
echo nodogcheckfor1234567890qwertyuiop >> �J�[�\���ւ��ݒ�.txt
echo debug=false >> �J�[�\���ւ��ݒ�.txt
echo wmode=false >> �J�[�\���ւ��ݒ�.txt
echo admin=true >> �J�[�\���ւ��ݒ�.txt
echo rebootokey=true >> �J�[�\���ւ��ݒ�.txt
echo hatenakeikoku=true >> �J�[�\���ւ��ݒ�.txt

cls
echo (����N�����̂�)
powershell sleep -m 500
cls
echo.
powershell sleep -m 100
color 04
echo �@�@�@�@�I�x���I
powershell sleep -m 200
color 0c
powershell sleep -m 100
color 07
powershell sleep -m 500
echo.
echo ����bat�t�@�C���i�ȉ��A�X�N���v�g�j�́A�J�[�\�����f�t�H���g�A�܂��͍��F�ɂ��邾���̃X�N���v�g�ł��B�Ȃ��Ƃ͎v���܂����A���̃X�N���v�g���g�p����ɂ������Ĕ����������Q�A�܂��̓R���s���[�^�[�̑������̔�Q�̐ӔC�͐���҂̂�����ӂɂ��闑�͈�؂̐ӔC�����܂���I
pause
echo.
echo.
:saisyonokeikokukakunin
SET /P selected=��낵���ł����H(Y=Yes / N=No)
if {%selected%}=={n} (del �J�[�\���ւ��ݒ�.txt & goto exit)
if {%selected%}=={no} (del �J�[�\���ւ��ݒ�.txt & goto exit) 
if {%selected%}=={yes} (goto henkoudefo)
if {%selected%}=={y} (goto henkoudefo)
echo %selected% ���I������܂����B
echo.
echo ?
pause
echo.
echo ���݂܂���B������x�����Ă��������܂��񂩁H
pause
goto saisyonokeikokukakunin
:henkoudefo
if {%cursorcolor%}=={��} (goto kurogotest)
if {%selected%}=={��} (goto defgotest)
cls

:defgotest
reg query "HKEY_CURRENT_USER\Control Panel\Cursors" /v "Scheme Source" | find "0x0"
cls
if {%ErrorLevel%}=={0} (goto sudenidef)
if {%ErrorLevel%}=={1} (goto defgo)

:sudenidef
title ���łɖ��邢
rundll32 user32.dll,MessageBeep
echo �ȂɁI�H�Ȃ����I����Ȃ��Ƃ͂��蓾�Ȃ����I�I�I���̂��΂ɋߊ��Ȃ��[���I
goto exit

:kurogotest
reg query "HKEY_CURRENT_USER\Control Panel\Cursors" /v "Scheme Source" | find "0x2"
cls
if {%ErrorLevel%}=={0} (goto sudenikuro)
if {%ErrorLevel%}=={1} (goto kurogo)

:sudenikuro
title ���łɍ���
rundll32 user32.dll,MessageBeep
echo �ȂɁI�H�Ȃ����I����Ȃ��Ƃ͂��蓾�Ȃ����I�I�I���̂��΂ɋߊ��Ȃ��[���I
goto exit

:defgo
pause
reg add "HKEY_CURRENT_USER\Control Panel\Cursors" /ve /f /d ""
title 1
reg add "HKEY_CURRENT_USER\Control Panel\Cursors" /v ContactVisualization /t REG_DWORD /f /d "0x00000001"
title 2
reg add "HKEY_CURRENT_USER\Control Panel\Cursors" /v CursorBaseSize /t REG_DWORD /f /d "0x00000020"
title 3
reg add "HKEY_CURRENT_USER\Control Panel\Cursors" /v GestureVisualization /t REG_DWORD /f /d "0x0000001f"
title 4
reg add "HKEY_CURRENT_USER\Control Panel\Cursors" /v "Scheme Source" /t REG_DWORD /f /d "0x0000000"
title 5
reg add "HKEY_CURRENT_USER\Control Panel\Cursors" /v AppStarting /t REG_EXPAND_SZ /f /d %SystemRoot%\cursors\
title 6
reg add "HKEY_CURRENT_USER\Control Panel\Cursors" /v Arrow /t REG_EXPAND_SZ /f /d %SystemRoot%\cursors\
title 7
reg add "HKEY_CURRENT_USER\Control Panel\Cursors" /v Crosshair /t REG_EXPAND_SZ /f /d %SystemRoot%\cursors\
title 8
reg add "HKEY_CURRENT_USER\Control Panel\Cursors" /v Hand /t REG_SZ /f /d ""
title 9
reg add "HKEY_CURRENT_USER\Control Panel\Cursors" /v Help /t REG_EXPAND_SZ /f /d %SystemRoot%\cursors\
title 10
reg add "HKEY_CURRENT_USER\Control Panel\Cursors" /v IBeam /t REG_EXPAND_SZ /f /d %SystemRoot%\cursors\
title 11
reg add "HKEY_CURRENT_USER\Control Panel\Cursors" /v No /t REG_EXPAND_SZ /f /d %SystemRoot%\cursors\
title 12
reg add "HKEY_CURRENT_USER\Control Panel\Cursors" /v NWPen /t REG_EXPAND_SZ /f /d %SystemRoot%\cursors\
title 13
reg add "HKEY_CURRENT_USER\Control Panel\Cursors" /v Person /t REG_EXPAND_SZ /f /d %SystemRoot%\cursors\
title 14
reg add "HKEY_CURRENT_USER\Control Panel\Cursors" /v SizeAll /t REG_EXPAND_SZ /f /d %SystemRoot%\cursors\
title 15
reg add "HKEY_CURRENT_USER\Control Panel\Cursors" /v SizeNESW /t REG_EXPAND_SZ /f /d %SystemRoot%\cursors\
title 16
reg add "HKEY_CURRENT_USER\Control Panel\Cursors" /v SizeNS /t REG_EXPAND_SZ /f /d %SystemRoot%\cursors\
title 17
reg add "HKEY_CURRENT_USER\Control Panel\Cursors" /v SizeNWSE /t REG_EXPAND_SZ /f /d %SystemRoot%\cursors\
title  18
reg add "HKEY_CURRENT_USER\Control Panel\Cursors" /v SizeWE /t REG_EXPAND_SZ /f /d %SystemRoot%\cursors\
title 19
reg add "HKEY_CURRENT_USER\Control Panel\Cursors" /v UpArrow /t REG_EXPAND_SZ /f /d %SystemRoot%\cursors\
title 20
reg add "HKEY_CURRENT_USER\Control Panel\Cursors" /v Wait /t REG_EXPAND_SZ /f /d %SystemRoot%\cursors\
title nice 21
cls
echo �f�t�H���g�ɖ߂��܂����B
pause
goto reboot

:kurogo
pause
reg add "HKEY_CURRENT_USER\Control Panel\Cursors" /ve /f /d "Windows �� "
title 1
reg add "HKEY_CURRENT_USER\Control Panel\Cursors" /v ContactVisualization /t REG_DWORD /f /d "0x00000001"
title 2
reg add "HKEY_CURRENT_USER\Control Panel\Cursors" /v CursorBaseSize /t REG_DWORD /f /d "0x00000020"
title 3
reg add "HKEY_CURRENT_USER\Control Panel\Cursors" /v GestureVisualization /t REG_DWORD /f /d "0x0000001f"
title 4
reg add "HKEY_CURRENT_USER\Control Panel\Cursors" /v "Scheme Source" /t REG_DWORD /f /d "0x0000002"
title 5
reg add "HKEY_CURRENT_USER\Control Panel\Cursors" /v AppStarting /t REG_EXPAND_SZ /f /d %SystemRoot%\cursors\wait_r.cur
title 6
reg add "HKEY_CURRENT_USER\Control Panel\Cursors" /v Arrow /t REG_EXPAND_SZ /f /d %SystemRoot%\cursors\arrow_r.cur
title 7
reg add "HKEY_CURRENT_USER\Control Panel\Cursors" /v Crosshair /t REG_EXPAND_SZ /f /d %SystemRoot%\cursors\cross_r.cur
title 8
reg add "HKEY_CURRENT_USER\Control Panel\Cursors" /v Hand /t REG_SZ /f /d ""
title 9
reg add "HKEY_CURRENT_USER\Control Panel\Cursors" /v Help /t REG_EXPAND_SZ /f /d %SystemRoot%\cursors\help_r.cur
title 10
reg add "HKEY_CURRENT_USER\Control Panel\Cursors" /v IBeam /t REG_EXPAND_SZ /f /d %SystemRoot%\cursors\beam_r.cur
title 11
reg add "HKEY_CURRENT_USER\Control Panel\Cursors" /v No /t REG_EXPAND_SZ /f /d %SystemRoot%\cursors\no_r.cur
title 12
reg add "HKEY_CURRENT_USER\Control Panel\Cursors" /v NWPen /t REG_EXPAND_SZ /f /d %SystemRoot%\cursors\pen_r.cur
title 13
reg add "HKEY_CURRENT_USER\Control Panel\Cursors" /v Person /t REG_EXPAND_SZ /f /d %SystemRoot%\cursors\person_r.cur
title 14
reg add "HKEY_CURRENT_USER\Control Panel\Cursors" /v SizeAll /t REG_EXPAND_SZ /f /d %SystemRoot%\cursors\move_r.cur
title 15
reg add "HKEY_CURRENT_USER\Control Panel\Cursors" /v SizeNESW /t REG_EXPAND_SZ /f /d %SystemRoot%\cursors\size1_r.cur
title 16
reg add "HKEY_CURRENT_USER\Control Panel\Cursors" /v SizeNS /t REG_EXPAND_SZ /f /d %SystemRoot%\cursors\size4_r.cur
title 17
reg add "HKEY_CURRENT_USER\Control Panel\Cursors" /v SizeNWSE /t REG_EXPAND_SZ /f /d %SystemRoot%\cursors\size2_r.cur
title 18
reg add "HKEY_CURRENT_USER\Control Panel\Cursors" /v SizeWE /t REG_EXPAND_SZ /f /d %SystemRoot%\cursors\size3_r.cur
title 19
reg add "HKEY_CURRENT_USER\Control Panel\Cursors" /v UpArrow /t REG_EXPAND_SZ /f /d %SystemRoot%\cursors\up_r.cur
title 20
reg add "HKEY_CURRENT_USER\Control Panel\Cursors" /v Wait /t REG_EXPAND_SZ /f /d %SystemRoot%\cursors\busy_r.cur
title black is nice. 21

cls
echo.
echo �ύX���܂���
pause
goto reboot

:AllDefult
cd /d %HOMEDRIVE%%HOMEPATH%
if exist �J�[�\���ւ��ݒ�.txt goto AllDefulttest
if not exist �J�[�\���ւ��ݒ�.txt goto Dogcheck

:Dogcheck
title Dogcheck %debugmode%
cls
echo '########:::'#######:::'######:::::::'######::'##::::'##:'########::'######::'##:::'##:
echo ##.... ##:'##.... ##:'##... ##:::::'##... ##: ##:::: ##: ##.....::'##... ##: ##::'##::
echo ##:::: ##: ##:::: ##: ##:::..:::::: ##:::..:: ##:::: ##: ##::::::: ##:::..:: ##:'##:::
echo ##:::: ##: ##:::: ##: ##::'####:::: ##::::::: #########: ######::: ##::::::: #####::::
echo ##:::: ##: ##:::: ##: ##::: ##::::: ##::::::: ##.... ##: ##...:::: ##::::::: ##. ##:::
echo ##:::: ##: ##:::: ##: ##::: ##::::: ##::: ##: ##:::: ##: ##::::::: ##::: ##: ##:. ##::
echo ########::. #######::. ######::::::. ######:: ##:::: ##: ########:. ######:: ##::. ##:
echo ........::::.......::::......::::::::......:::..:::::..::........:::......:::..::::..::
echo.
start chrome.exe --window-size=0,0 --incognito -- https://www.youtube.com/watch?v=kO77pZFJp1o
echo Dim answer:answer = MsgBox("_;[ :-}3]^~",vbOKCancel,"Dogcheck"):WScript.Quit(answer) > %TEMP%\msgbox.vbs & %TEMP%\msgbox.vbs
taskkill /im chrome.exe
rem �t�@�C���폜
del /Q %TEMP%\msgbox.vbs
exit

:AllDefulttest
cd /d %HOMEDRIVE%%HOMEPATH% 
find "nodogcheckfor1234567890qwertyuiop" �J�[�\���ւ��ݒ�.txt
cls
if %ErrorLevel%==0 goto AllDefult1
if %ErrorLevel%==1 goto Dogcheck

:AllDefult1
title �J�[�\���ւ��̃A���C���X�g�[�� (�����I)
Cls
echo �A���C���X�g�[���̎d����I�� b�Ŗ߂�܂��B
echo �I����������������������A������x������������͂��đI�����܂��B
echo.
echo 1 ����bat�t�@�C���Ɋւ��邷�ׂẴf�[�^���폜���A�J�[�\�������F�ɖ߂�
echo.
echo 2 �J�[�\���͂��̂܂܂ɂ��āA���ׂč폜����
choice /c 12wsb /n /m ""
if %ErrorLevel%==1 goto alldefselect1
if %ErrorLevel%==2 goto alldefselect2
if %ErrorLevel%==3 goto alldefselect1
if %ErrorLevel%==4 goto alldefselect2
if %ErrorLevel%==5 goto hazime

:alldefselect1
Cls
echo �A���C���X�g�[���̎d����I�� b�Ŗ߂�܂��B
echo �I����������������������A������x������������͂��đI�����܂��B
echo.
echo.
echo 1 #����bat�t�@�C���Ɋւ��邷�ׂẴf�[�^���폜���A�J�[�\�������F�ɖ߂�#
echo.
echo 2 �J�[�\���͂��̂܂܂ɂ��āA���ׂč폜����
choice /c 12wsb /n /m ""
if %ErrorLevel%==1 set alldefselect=1&goto :alldefselectokey
if %ErrorLevel%==2 goto alldefselect2
if %ErrorLevel%==3 set alldefselect=1&goto :alldefselectokey
if %ErrorLevel%==4 goto alldefselect2
if %ErrorLevel%==5 goto hazime

:alldefselect2
Cls
echo �A���C���X�g�[���̎d����I�� b�Ŗ߂�܂��B
echo �I����������������������A������x������������͂��đI�����܂��B
echo.
echo 1 ����bat�t�@�C���Ɋւ��邷�ׂẴf�[�^���폜���A�J�[�\�������F�ɖ߂�
echo.
echo 2 #�J�[�\���͂��̂܂܂ɂ��āA���ׂč폜����
choice /c 12wsb /n /m ""
if %ErrorLevel%==1 goto alldefselect1
if %ErrorLevel%==2 set alldefselect=2&goto :alldefselectokey
if %ErrorLevel%==3 goto alldefselect1
if %ErrorLevel%==4 set alldefselect=2&goto :alldefselectokey
if %ErrorLevel%==5 goto hazime

:alldefselectokey
cls
color 9f
title �J�[�\���ւ��@���� %debugmode%
echo ���̃A���C���X�g�[�����j���[�́A���̃o�b�`�t�@�C�����ύX�������W�X�g���A����L�^�p�̃t�@�C�������ׂČ��̏�Ԃɖ߂����̂ł��B
pause
cls
echo ���������āA���̋@�\���g�p����ƃ}�E�X�J�[�\���������̔��F�A�����Ă��̃o�b�`�t�@�C��������N�����b�Z�[�W������鏉���̏�Ԃɖ߂����ƂɂȂ�܂��I
echo (OS�������������킯�ł͂Ȃ�)
pause
cls
echo �܂��A����bat���N�����ĉ��炩�̏�Q�A�܂��͕s���v�������ꍇ�̐ӔC�͍쐬�҂̂�����ӂɂ��闑�͈�ؕ����܂���I
echo.
pause
:AllDefultOkey
SET /P selected=��낵���ł����H(Y=Yes / N=No / B=Back)
if {%selected%}=={y} (goto :yes2)
if {%selected%}=={yes} (goto :yes2)
if {%selected%}=={n} (goto :no2)
if {%selected%}=={no} (goto :no2)
if {%selected%}=={back} (goto :hazime)
if {%selected%}=={b} (goto :hazime)
if {%selected%}=={debugyesnow} (goto :yes2go)
echo ?
echo.
pause
echo ���݂܂���B������x�����Ă��������܂��񂩁H
echo.
pause
goto AllDefultOkey

:no2
echo �f�t�H���g�ɂ͖߂�܂���ł���
goto exit

:yes2
SET /P selected=�{���ɂ����ł��ˁH(Y=Yes / N=No / B=Back)
if {%selected%}=={y} (goto :yes2go)
if {%selected%}=={yes} (goto :yes2go)
if {%selected%}=={n} (goto :no2)
if {%selected%}=={no} (goto :no2)
if {%selected%}=={back} (goto :hazime)
if {%selected%}=={b} (goto :hazime)
if {%selected%}=={debugyesnow} (goto :yes2go)
echo.
echo ?
pause
echo.
echo ���݂܂���B������x�����Ă��������܂��񂩁H
pause
goto rebootok

:yes2go
echo ���s���܂��B�߂�ꍇ�̓o�b�`�t�@�C�����~���Ă��������B
pause

color 1f
cd /d %HOMEDRIVE%%HOMEPATH%
if exist ����J�[�\��.txt goto alldefnow
if not exist ����J�[�\��.txt goto erroralldef1
:erroralldef1
rem ���b�Z�[�W�\��
rundll32 user32.dll,MessageBeep
cls
echo A problem has been detected and windows has been shut down to prevent echo damage to your computer.
echo If this is the first time you've seen this stop error screen,
echo restart your computer.
echo If this screen appears again,
echo follow these steps:
echo.
echo Check to be sure you have adequate disk space.
echo If a driver is identified in the stop message,
echo disable the driver or check with the manufacturer for driver updates.
echo Try changing Video adapters.
echo.
echo Check with your hardware vendor for any BIOS updates.
echo Disable BIOS memory options such as caching or shadowing.
echo If you need to use Safe Mode to remove or disable components,
echo restart your computer, press F8 select Advanced Startup Options,
echo and then select Safe Mode.
echo.
echo Technical information:
echo.
echo *** STOP: 0x0000008E (0xC0000005,0x8054DF87,0xB8F97810,0x00000000)
echo.
echo Beginning dump of physical memory
echo physical memory dump complete.
echo Contact your system administrator or technical support group for further echo assistance.

echo Dim answer:answer = MsgBox("�ǂ��Ȃ�̂��A�킩���Ă�̂��ȁH",vbOKCancel,"�G���["):WScript.Quit(answer) > %TEMP%\msgbox.vbs & %TEMP%\msgbox.vbs
echo %ERRORLEVEL%
rem �t�@�C���폜
del /Q %TEMP%\msgbox.vbs
if {%selected%}=={1} (goto :erroralldef1ok)
if {%selected%}=={2} (goto :erroralldef1ok)
goto erroralldef1ok

:erroralldef2
rem ���b�Z�[�W�\��
echo Dim answer:answer = MsgBox("�ǂ��Ȃ�̂��A�킩���Ă�̂��ȁH",vbOKCancel,"�G���["):WScript.Quit(answer) > %TEMP%\msgbox.vbs & %TEMP%\msgbox.vbs
echo %ERRORLEVEL%
rem �t�@�C���폜
del /Q %TEMP%\msgbox.vbs
if {%selected%}=={1} (goto :erroralldef2ok)
if {%selected%}=={2} (goto :erroralldef2ok)
goto erroralldef2ok

:erroralldef1ok
rem ���b�Z�[�W�\��
echo Dim answer:answer = MsgBox("���̃G���[�͂��ׂĂ��f�t�H���g�ɖ߂��ۂɑ��݂��Ă���͂��̃t�@�C�������݂��Ă��Ȃ��Ƃ��ɔ������܂��B",vbOKCancel,"�G���[�̌���"):WScript.Quit(answer) > %TEMP%\msgbox.vbs & %TEMP%\msgbox.vbs
echo %ERRORLEVEL%
 
rem �t�@�C���폜
del /Q %TEMP%\msgbox.vbss

cls
echo A problem has been detected and windows has been shut down to prevent echo damage to your computer.
echo If this is the first time you've seen this stop error screen,
echo restart your computer.
echo If this screen appears again,
echo follow these steps:
echo.
echo Check to be sure you have adequate disk space.
echo If a driver is identified in the stop message,
echo disable the driver or check with the manufacturer for driver updates.
echo Try changing Video adapters.
echo.
echo Check with your hardware vendor for any BIOS updates.
echo Disable BIOS memory options such as caching or shadowing.
echo If you need to use Safe Mode to remove or disable components,
echo restart your computer, press F8 select Advanced Startup Options,
echo and then select Safe Mode.
echo.
echo Technical information:
echo.
echo *** STOP: 0x0000008E (0xC0000005,0x8054DF87,0xB8F97810,0x00000000)
echo.
echo Beginning dump of physical memory
echo physical memory dump complete.
echo Contact your system administrator or technical support group for further echo assistance.
echo Dim answer:answer = MsgBox("�܂��A�����炭���Ȃ��� AllDefult �����s����ۂɏ���J�[�\���ύX.txt���폜�����̂��������Ǝv���܂����ǂˁB",vbOKCancel,"�G���[�̖{���̌���"):WScript.Quit(answer) > %TEMP%\msgbox.vbs & %TEMP%\msgbox.vbs
echo %ERRORLEVEL%
if {%errorlevel%}=={1} (goto :erroralldef3ok)
if {%errorlevel%}=={2} (goto :erroralldef3no)
rem �t�@�C���폜
del /Q %TEMP%\msgbox.vbs

:erroralldef3ok
cls
echo A problem has been detected and windows has been shut down to prevent echo damage to your computer.
echo If this is the first time you've seen this stop error screen,
echo restart your computer.
echo If this screen appears again,
echo follow these steps:
echo.
echo Check to be sure you have adequate disk space.
echo If a driver is identified in the stop message,
echo disable the driver or check with the manufacturer for driver updates.
echo Try changing Video adapters.
echo.
echo Check with your hardware vendor for any BIOS updates.
echo Disable BIOS memory options such as caching or shadowing.
echo If you need to use Safe Mode to remove or disable components,
echo restart your computer, press F8 select Advanced Startup Options,
echo and then select Safe Mode.
echo.
echo Technical information:
echo.
echo *** STOP: 0x0000008E (0xC0000005,0x8054DF87,0xB8F97810,0x00000000)
echo.
echo Beginning dump of physical memory
echo physical memory dump complete.
echo damn u bich
echo Contact your system administrator or technical support group for further echo assistance.
echo Dim answer:answer = MsgBox(": )",vbOKCancel,"�G���["):WScript.Quit(answer) > %TEMP%\msgbox.vbs & %TEMP%\msgbox.vbs
 
rem �t�@�C���폜
del /Q %TEMP%\msgbox.vbs
exit

:erroralldef3no
cls
echo A problem has been detected and windows has been shut down to prevent echo damage to your computer.
echo If this is the first time you've seen this stop error screen,
echo restart your computer.
echo If this screen appears again,
echo follow these steps:
echo.
echo Check to be sure you have adequate disk space.
echo If a driver is identified in the stop message,
echo disable the driver or check with the manufacturer for driver updates.
echo Try changing Video adapters.
echo if you do you a delete .txt file, so fuck you,
echo Check with your hardware vendor for any BIOS updates.
echo Disable BIOS memory options such as caching or shadowing.
echo If you need to use Safe Mode to remove or disable components,
echo restart your computer, press F8 select Advanced Startup Options,
echo and then select Safe Mode.
echo.
echo Technical information:
echo.
echo *** STOP: 0x0000008E (0xC0000005,0x8054DF87,0xB8F97810,0x00000000)
echo.
echo Beginning dump of physical memory
echo physical memory dump complete.
echo Contact your system administrator or technical support group for further echo assistance.
echo Dim answer:answer = MsgBox("�������[��B�ł��A�{���Ƀo�O�ł��ꂪ�N�������Ă��ƂȂ琻��҂ɓ`���Ē����Ă�����Ă��������ˁB",vbOKCancel,"�G���[�H"):WScript.Quit(answer) > %TEMP%\msgbox.vbs & %TEMP%\msgbox.vbs
echo %ERRORLEVEL%
del /Q %TEMP%\msgbox.vbs
exit

:alldefnow
cls
color 0f
if %alldefselect%==1 goto alldefnowhenkou
if %alldefselect%==2 goto alldefnowsettingdel

:alldefnowsettingdel
del ����J�[�\��.txt
del �J�[�\���ւ��ݒ�.txt
goto alldefnowfinish

:alldefnowhenkou
del ����J�[�\��.txt
del �J�[�\���ւ��ݒ�.txt
reg add "HKEY_CURRENT_USER\Control Panel\Cursors" /ve /f /d ""
title 1
reg add "HKEY_CURRENT_USER\Control Panel\Cursors" /v ContactVisualization /t REG_DWORD /f /d "0x00000001"
title 2
reg add "HKEY_CURRENT_USER\Control Panel\Cursors" /v CursorBaseSize /t REG_DWORD /f /d "0x00000020"
title 3
reg add "HKEY_CURRENT_USER\Control Panel\Cursors" /v GestureVisualization /t REG_DWORD /f /d "0x0000001f"
title 4
reg add "HKEY_CURRENT_USER\Control Panel\Cursors" /v "Scheme Source" /t REG_DWORD /f /d "0x0000000"
title 5
reg add "HKEY_CURRENT_USER\Control Panel\Cursors" /v AppStarting /t REG_EXPAND_SZ /f /d %SystemRoot%\cursors\
title 6
reg add "HKEY_CURRENT_USER\Control Panel\Cursors" /v Arrow /t REG_EXPAND_SZ /f /d %SystemRoot%\cursors\
title 7
reg add "HKEY_CURRENT_USER\Control Panel\Cursors" /v Crosshair /t REG_EXPAND_SZ /f /d %SystemRoot%\cursors\
title 8
reg add "HKEY_CURRENT_USER\Control Panel\Cursors" /v Hand /t REG_SZ /f /d ""
title 9
reg add "HKEY_CURRENT_USER\Control Panel\Cursors" /v Help /t REG_EXPAND_SZ /f /d %SystemRoot%\cursors\
title 10
reg add "HKEY_CURRENT_USER\Control Panel\Cursors" /v IBeam /t REG_EXPAND_SZ /f /d %SystemRoot%\cursors\
title 11
reg add "HKEY_CURRENT_USER\Control Panel\Cursors" /v No /t REG_EXPAND_SZ /f /d %SystemRoot%\cursors\
title 12
reg add "HKEY_CURRENT_USER\Control Panel\Cursors" /v NWPen /t REG_EXPAND_SZ /f /d %SystemRoot%\cursors\
title 13
reg add "HKEY_CURRENT_USER\Control Panel\Cursors" /v Person /t REG_EXPAND_SZ /f /d %SystemRoot%\cursors\
title 14
reg add "HKEY_CURRENT_USER\Control Panel\Cursors" /v SizeAll /t REG_EXPAND_SZ /f /d %SystemRoot%\cursors\
title 15
reg add "HKEY_CURRENT_USER\Control Panel\Cursors" /v SizeNESW /t REG_EXPAND_SZ /f /d %SystemRoot%\cursors\
title 16/
reg add "HKEY_CURRENT_USER\Control Panel\Cursors" /v SizeNS /t REG_EXPAND_SZ /f /d %SystemRoot%\cursors\
title 17
reg add "HKEY_CURRENT_USER\Control Panel\Cursors" /v SizeNWSE /t REG_EXPAND_SZ /f /d %SystemRoot%\cursors\
title  18
reg add "HKEY_CURRENT_USER\Control Panel\Cursors" /v SizeWE /t REG_EXPAND_SZ /f /d %SystemRoot%\cursors\
title 19
reg add "HKEY_CURRENT_USER\Control Panel\Cursors" /v UpArrow /t REG_EXPAND_SZ /f /d %SystemRoot%\cursors\
title 20
reg add "HKEY_CURRENT_USER\Control Panel\Cursors" /v Wait /t REG_EXPAND_SZ /f /d %SystemRoot%\cursors\
title 21

:alldefnowfinish
cls
title ���悤�Ȃ�I %debugmode%
echo ���ׂĂ��f�t�H���g�ɖ߂��܂����B
pause
echo ����ł��ʂ�ł��ˁB���悤�Ȃ�B
pause
rem ���g�̃p�X���擾�A�����Ƀp�X���ړ�
cd %~0
rem ���g�̖��O���擾���폜
del %~n0%~x0
goto exit

:reboot

find "rebootokey=false" �J�[�\���ւ��ݒ�.txt
if {%errorlevel%}=={0} (goto rebootexit)
if {%errorlevel%}=={1} (goto rebootoktest)
cls

:rebootexit
exit

:rebootoktest
find "rebootokey=true" �J�[�\���ւ��ݒ�.txt
if {%errorlevel%}=={0} (goto reboot1)
if {%errorlevel%}=={1} (goto reboot1)
cls

:reboot1
title �ċN���̊m�F %debugmode%
cls
SET /P selected=�ċN�����܂����H�ċN�����Ȃ��ꍇ�͕ύX���K�p����܂���(Y=Yes / N=No / S=Skip)
if {%selected%}=={egg} (goto :secret)
if {%selected%}=={y} (goto :yesre)
if {%selected%}=={yes} (goto :yesre)
if {%selected%}=={n} (goto :nore)
if {%selected%}=={no} (goto :nore)
if {%selected%}=={skip} (goto :exit)
if {%selected%}=={s} (goto :exit)

echo.
echo ?
pause
echo.
echo ���݂܂���B������x�����Ă��������܂��񂩁H
pause
goto rebootok

:nore
echo �ċN���͂���܂���ł����B
pause
echo ...
pause
goto higan

:yesre
echo �ċN�����܂��B
pause
shutdown /r /t 2
goto reboot

:higan
title �ߊ� %debugmode%
SET /P selected=�Ȃ点�߂ăT�C���A�E�g�����ł����肢���܂�.....(Y=Yes / N=No / B=Back)
if {%selected%}=={egg} (goto :secret)
if {%selected%}=={y} (goto :yes)
if {%selected%}=={yes} (goto :yes)
if {%selected%}=={n} (goto :nohi)
if {%selected%}=={no} (goto :nohi)
if {%selected%}=={back} (goto :rebootok)
if {%selected%}=={b} (goto :rebootok)

echo ?
pause
echo ���݂܂���B������x�����Ă��������܂��񂩁H
pause
goto higan

:nohi
echo.
echo �킩��܂���....
goto exit

:yes
echo ���肪�Ƃ��������܂��B
goto Lock

:secret
title why? %debugmode%
echo �����H�Ȃ�ł��̌��t��....
pause
SET /P selected=�ǂ��ł��̌��t��m������ł����H(���[�}���œ���)
if {%selected%}=={nakamiwomita} (goto :secrethentai)
if {%selected%}=={siranai} (goto :secretnomal)
if {%selected%}=={siran} (goto :secretnomal)
if {%selected%}=={kaiseki} (goto :secrethentai)
if {%selected%}=={tyokkan} (goto :secretnomal)

if {%selected%}=={tyokkan} (goto :secretnomal) else (goto secretnomal)

echo.
echo ?
pause
echo.
echo ���݂܂���B������x�����Ă��������܂��񂩁H
pause
goto rebootok

:secretnomal
echo �����H�Ă��Ƃ͒����ł�������Ă��ƂȂ́H
pause
echo �����ł���...?
goto exit
:secrethentai
echo �L���[�b�I%USERNAME%����̃G�b�`�[�I
goto exit


:testinthecalbeep
title counttest mode
cls
SET /P runcount=type run count :
cls
echo do not enter alphabet only number
echo.
echo if enter alphabet = inf loop
echo.
pause
cls
echo type run count :%runcount%
echo count test:%runcount% loop
set calbeepnotfound=1
cls

:loop
cls
echo count test:%runcount% loop %calbeep2%
echo %calbeep% 
powershell sleep 0.2

set /a calbeep=calbeep+1
set /a calbeepnotfound=calbeepnotfound+1
if %calbeepnotfound% gtr %runcount%0 goto finishcalbeep
if %calbeep% gtr 10  (set /a calbeep2=calbeep2+1)
if %calbeep% gtr 10  (set /a calbeep=calbeep-10)
cls

goto :loop
:finishcalbeep
echo Count finish.
pause
echo.
echo b n
SET /P selected=back or next count
if {%selected%}=={b} (goto :hazime) 
if {%selected%}=={n} (goto :testinthecalbeep) else goto testinthecalbeep
goto finishcalbeep
exit

:easteregg
mode con: cols=5 lines=5
title 
cls
echo Dim answer:answer = MsgBox("",,""):WScript.Quit(answer) > %TEMP%\msgbox.vbs & %TEMP%\msgbox.vbs
echo %ERRORLEVEL%
cls
echo Dim answer:answer = MsgBox("...",,""):WScript.Quit(answer) > %TEMP%\msgbox.vbs & %TEMP%\msgbox.vbs
echo %ERRORLEVEL%
cls
cls
echo Dim answer:answer = MsgBox("�Ȃ���",vbExclamation, ""):WScript.Quit(answer) > %TEMP%\msgbox.vbs & %TEMP%\msgbox.vbs
echo %ERRORLEVEL%
cls
title �݂��́H
:eastereggh
cls
set ealoop=0
:eastereggloop
echo �݂��́H
set /a ealoop=%ealoop+1
if %ealoop% gtr 10 (goto eastereggloopout)
goto eastereggloop
:eastereggloopout
echo Dim answer:answer = MsgBox("�� �� �� �H",vbinfomation + vbYesNo, "�݂��́H"):WScript.Quit(answer) > %TEMP%\msgbox.vbs & %TEMP%\msgbox.vbs
echo %ERRORLEVEL%
if (%errorlevel%)=={1} (goto eastereggif1yes)
if (%errorlevel%)=={2} (goto eastereggif1no)

:eastereggif1yes
cls
echo Dim answer:answer = MsgBox("���͂͂͂����͂��Ђ�",vbExclamation,""):WScript.Quit(answer) > %TEMP%\msgbox.vbs & %TEMP%\msgbox.vbs
:eastereggif1yesh
cls
set eaif1loop=0
:eastereggif1yesloop
start cmd.exe
set /a eaif1loop=eaif1loop+1
if %eaif1loop% gtr 5 (goto eastereggif1yesloopout)
goto eastereggif1yesloop
:eastereggif1yesloopout
echo Dim answer:answer = MsgBox("�Ȃ�ŁH",vbExclamation,""):WScript.Quit(answer) > %TEMP%\msgbox.vbs & %TEMP%\msgbox.vbs
echo Dim answer:answer = MsgBox("�Ȃ�ŁH",vbExclamation,""):WScript.Quit(answer) > %TEMP%\msgbox.vbs & %TEMP%\msgbox.vbs
echo Dim answer:answer = MsgBox("�Ȃ�łȂ�łȂ�łȂ�łȂ�łȂ�łȂ�łȂ�łȂ�łȂ�łȂ�łȂ�łȂ�łȂ�łȂ�łȂ�łȂ�łȂ�łȂ�łȂ�łȂ�łȂ�łȂ�łȂ�łȂ�łȂ�łȂ�łȂ�łȂ�łȂ�łȂ�łȂ�łȂ�łȂ�łȂ�łȂ�łȂ�łȂ�łȂ�łȂ�łȂ�łȂ�ŁH�H�H�H�H�H�H�H�H�H�H�H�H�H�H�H�H�H�H",vbExclamation,""):WScript.Quit(answer) > %TEMP%\msgbox.vbs & %TEMP%\msgbox.vbs
echo Dim answer:answer = MsgBox("�����Ȃ�",vbExclamation,""):WScript.Quit(answer) > %TEMP%\msgbox.vbs & %TEMP%\msgbox.vbs
echo Dim answer:answer = MsgBox("�E�F�u�J�����ւ̃A�N�Z�X�����ۂ���܂����B",vbCritical,"�A�N�Z�T�������p�ł��܂���"):WScript.Quit(answer) > %TEMP%\msgbox.vbs & %TEMP%\msgbox.vbs
echo Dim answer:answer = MsgBox("�����Ȃ������Ȃ������Ȃ������Ȃ������Ȃ������Ȃ������Ȃ������Ȃ������Ȃ������Ȃ������Ȃ�",vbExclamation,""):WScript.Quit(answer) > %TEMP%\msgbox.vbs & %TEMP%\msgbox.vbs
echo Dim answer:answer = MsgBox("C: �ɃA�N�Z�X�ł��܂���B�A�N�Z�X�����ۂ���܂����B" ,vbCritical,"�ꏊ�����p�ł��܂���"):WScript.Quit(answer) > %TEMP%\msgbox.vbs & %TEMP%\msgbox.vbs
echo Dim answer:answer = MsgBox("",vbCritical,"�ꏊ�����p�ł��܂���ł���"):WScript.Quit(answer) > %TEMP%\msgbox.vbs & %TEMP%\msgbox.vbs
echo Dim answer:answer = MsgBox("�� �� �� ��",vbExclamation,""):WScript.Quit(answer) > %TEMP%\msgbox.vbs & %TEMP%\msgbox.vbs
taskkill /f /im explorer.exe
start explorer.exe
title �H�H�H�H�H�H�H�H�H�H�H�H�H�H�H�H
color 47
cls
pause
ping -n 1 127.0.0.1 > nul 2>&1
cls
echo ��
ping -n 1 127.0.0.1 > nul 2>&1
cls
echo ���O
ping -n 1 127.0.0.1 > nul 2>&1
cls
echo ���O��
ping -n 1 127.0.0.1 > nul 2>&1
cls
echo ���O�͌�
ping -n 1 127.0.0.1 > nul 2>&1
cls
echo ���O�͌��
ping -n 1 127.0.0.1 > nul 2>&1
cls
echo ���O�͌����
ping -n 1 127.0.0.1 > nul 2>&1
cls
echo ���O�͌������
ping -n 1 127.0.0.1 > nul 2>&1
cls
echo ���O�͌�������
ping -n 1 127.0.0.1 > nul 2>&1
cls
echo ���O�͌������ׂ�
ping -n 1 127.0.0.1 > nul 2>&1
cls
echo ���O�͌������ׂ���
ping -n 1 127.0.0.1 > nul 2>&1
powershell sleep 1
shutdown /r /t 10 /c ����ł����炦
taskkill /f /im cmd.exe

:eastereggif1no
echo Dim answer:answer = MsgBox(".....",vbExclamation,""):WScript.Quit(answer) > %TEMP%\msgbox.vbs & %TEMP%\msgbox.vbs
goto hazime

:1908hell
cls
set eggloop=0
:loop1908
title %eggloop%
echo 1908 :D
echo 1908 :P
echo 1908 xD
set /a eggloop=%eggloop+1
if %eggloop% gtr 1908 (pause&echo 1 9 0 8 :D :D :D :D :D :D&goto exit)
goto loop1908


:Lock
rundll32.exe user32.dll, LockWorkStation
goto reboot

:exit
pause
:reboot
